Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fb2fda01-f8af-4657-9434-8cc1e4174283">
    <name>ДатаНачалаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fdadcdac-c84a-4c5e-9f9d-425c9ce8d7b8">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Ремонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГарантийныйРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c78bcaa2-754f-4a7f-9e89-f5a6e42d7594">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущееСостояниеОР/торо_ТекущееСостояниеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущееСостояниеОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидЭксплуатации</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СтатусыДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e3824168-331e-4e9c-9a97-88d442450c1c">
    <name>гкс_ВыполненНеобходимАктПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b486cddf-c606-48a0-b4d9-79359f8995b4">
    <name>Устраняется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="12013120-ddb7-448d-8a52-b1a0212dd9c4">
    <name>Выполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="17242492-094d-4d6f-805a-a10d65fa8670">
    <name>Зарегистрирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="62ccdc8a-74d4-48f3-bfc6-e3928a0ae7cb">
    <name>ВозобновленоПослеОтказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e4ffdb13-bdf4-4105-92f1-9c5dc748637d">
    <name>Выполняется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="91bc17f5-8b7c-487f-8759-3e891929fcc6">
    <name>ОтказИсполнителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="97ff8156-77b5-45f9-93d6-665a3335a2bf">
    <name>ОтказПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ee12e5d3-3edb-491c-8af6-c4cb0fc16d16">
    <name>гкс_Новый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/ObjectModule.bsl
#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Расш_гкс_ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.торо_ВыявленныеДефекты.Записывать 	= Истина;
	Движения.торо_Ремонты.Записывать 			= Истина;

	Для Каждого ТекСтрокаСписокДефектов Из СписокДефектов Цикл

		// регистр сведений торо_ВыявленныеДефекты 
		Движение = Движения.торо_ВыявленныеДефекты.Добавить();
		Движение.ОбъектРемонта                          = ТекСтрокаСписокДефектов.ОбъектРемонта;
		Движение.ОтказавшийЭлемент                      = ТекСтрокаСписокДефектов.ОтказавшийЭлемент;
		Движение.Период                                 = ДатаОбнаружения;
		Движение.ДефектПричина                          = ТекСтрокаСписокДефектов.ДефектПричина;
		Движение.ДефектВыявленВПроцессе                 = ДефектВыявленВПроцессе;
		Движение.ВидДефекта                             = ТекСтрокаСписокДефектов.ВидДефекта;
		Движение.ID                                     = ТекСтрокаСписокДефектов.ID;
		Движение.Организация                            = Организация;
		Движение.Подразделение                          = Подразделение;
		Движение.ПодразделениеИсполнитель               = ТекСтрокаСписокДефектов.ПодразделениеИсполнитель;
		Движение.КритичностьДефекта                     = ТекСтрокаСписокДефектов.КритичностьДефекта;
		Движение.ДефектОписание                         = ТекСтрокаСписокДефектов.ДефектОписание;
		Движение.НаправлениеНаУстранение                = ТекСтрокаСписокДефектов.НаправлениеНаУстранение;
		#Вставка
		Движение.гкс_СимптомДефекта                         = ТекСтрокаСписокДефектов.гкс_СимптомДефекта;
		Движение.гкс_КорневаяПричина                        = ТекСтрокаСписокДефектов.гкс_КорневаяПричина;
		#КонецВставки

		// ФО торо_НазначениеНаРемонтСУчетомРисков
		Движение.ДатаНачалаРемонта                      = ТекСтрокаСписокДефектов.ДатаНачалаРемонта;
		Движение.ДатаОкончанияРемонта                   = ТекСтрокаСписокДефектов.ДатаОкончанияРемонта;
		Движение.КрайняяДопустимаяДатаЗавершенияРемонта = ТекСтрокаСписокДефектов.КрайняяДопустимаяДатаЗавершенияРемонта;

		// регистр сведений торо_Ремонты
		Движение = Движения.торо_Ремонты.Добавить();
		Движение.Период                                 = МоментВремени().Дата;
		Движение.ID                                     = ТекСтрокаСписокДефектов.ID;
		Движение.ОбъектРемонта                          = ТекСтрокаСписокДефектов.ОтказавшийЭлемент;
		Движение.ГарантийныйРемонт                      = ТекСтрокаСписокДефектов.ГарантийныйРемонт;

		// ФО торо_НазначениеНаРемонтСУчетомРисков
		Движение.ДатаНачалаПлан                         = ТекСтрокаСписокДефектов.ДатаНачалаРемонта;
		Движение.ДатаОкончанияПлан                      = ТекСтрокаСписокДефектов.ДатаОкончанияРемонта;
		Движение.КрайняяДопустимаяДатаЗавершенияРемонта = ТекСтрокаСписокДефектов.КрайняяДопустимаяДатаЗавершенияРемонта;


	КонецЦикла;

	Если НЕ Отказ Тогда
		УстановитьУправляемыеБлокировки();
	КонецЕсли;

	ТаблицаВО = СформироватьТаблицуВнешнихОснований();
	ДвиженияПоРегистру_торо_ВнешниеОснованияДляРабот(РежимПроведения, ТаблицаВО, Отказ);

	Движения.торо_СтатусыДокументовВыявленныхДефектов.Записывать = Истина;
	торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(Ссылка, Ссылка, Движения, Перечисления.торо_СтатусыДокументов.Зарегистрирован);
	торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовОснований(Ссылка);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура Расш_гкс_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если СписокДефектов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='En la parte tabular ""la Lista de los defectos"" no hay líneas.';ru='В табличной части ""Список дефектов"" нет строк.';en='There are no lines in the tabular part of the ""List of defects"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;

	Для Каждого ТекСтрокаСписокДефектов Из СписокДефектов Цикл
		
		Если ТекСтрокаСписокДефектов.ОбъектРемонта.Пустая() Тогда
			ТекстСообщения = НСтр("es='de la reparación';ru='Не указан объект ремонта';en='Repair object not specified'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
		#Удаление
		Если ТекСтрокаСписокДефектов.ВидДефекта.Пустая() Тогда
			ШаблонСообщения = НСтр("es='2.';ru='Не указан вид дефекта %1/%2.';en='The type of defect%1 /%2 is not specified.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрокаСписокДефектов.ОбъектРемонта, ТекСтрокаСписокДефектов.ОтказавшийЭлемент);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		#КонецУдаления
		
	КонецЦикла;

КонецПроцедуры

// гкс+ [Релиз 1] Куст 16.12.2020
&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Если Не Отказ И Проведен Тогда 
		Если гкс_Влияние = Перечисления.гкс_Влияние.ЭкономическиеПотери
			ИЛИ гкс_Влияние = Перечисления.гкс_Влияние.БезЭкономическихПотерь Тогда 
			ОбновитьСостояниеОР();
		КонецЕсли;
	КонецЕсли;
	
	// Гкс+[TOIR20-673] Зозуля А.В. от 05.08.2025. Добавлено:{
	Если Не Отказ И ДополнительныеСвойства.Свойство("гкс_СтатусДокументаНовый") Тогда
		торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(Ссылка, Ссылка, Движения, Перечисления.торо_СтатусыДокументов.гкс_Новый);			
		Движения.Записать();		
	КонецЕсли;	
	// } Гкс-[TOIR20-673] Зозуля А.В. от 05.08.2025.
	
КонецПроцедуры
// гкс- [Релиз 1] Куст 16.12.2020

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 16.12.2020
Процедура ОбновитьСостояниеОР()
	ПроверитьАварийныйПростой();
	// для сохранения порядка состояний ОР, нельзя делать проверку состояния ОР со срезом на дату
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.ОбъектРемонта КАК ОР
	               |ПОМЕСТИТЬ ВсеОР
	               |ИЗ
	               |	&ТЧ1 КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рег.ВидЭксплуатации КАК ВидЭксплуатации, Рег.ОбъектРемонта КАК ОР
	               |ИЗ
	               |	РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&Дата, ОбъектРемонта В 
				   |(Выбрать Различные ТЧ.ОР ИЗ ВсеОР КАК ТЧ)) КАК Рег
	               |ГДЕ
	               |	Рег.ВидЭксплуатации.ТипЭксплуатации = Значение(Перечисление.торо_ТипЭксплуатации.Эксплуатация)
				   | " + " ; " + "
				   |Выбрать
				   |ТЧ.Ссылка КАК Ссылка, ТЧ.Проведен КАК Проведен
				   |ИЗ Документ.торо_СостоянияОбъектовРемонта КАК ТЧ
				   |Где ТЧ.гкс_ПричинаСоздания = 1 И ТЧ.ДокументОснование = &ВД
				   |Упорядочить По ТЧ.Проведен
				   |
				   |
				   |
				   |
				   |
				   |
				   |";
	Запрос.УстановитьПараметр("ТЧ1", СписокДефектов.Выгрузить(,"ОбъектРемонта"));
	Запрос.УстановитьПараметр("Дата", Новый Граница(ДатаОбнаружения, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ВД", Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ПакетОдин = 1;
	ДокСост = Неопределено;
	МассивДокДляПерепроведения = Новый Массив();
	ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Если Не РезультатЗапроса[2].Пустой() Тогда 
		ВыборкаДок = РезультатЗапроса[2].Выбрать();
		Если ВыборкаДок.Следующий() Тогда 
			ДокСост = ВыборкаДок.Ссылка.ПолучитьОбъект();
		КонецЕсли;
	КонецЕсли;
	Если Не РезультатЗапроса[1].Пустой() Тогда 
		Если ДокСост = Неопределено Тогда 
			ДокСост = Документы.торо_СостоянияОбъектовРемонта.СоздатьДокумент();
			ДокСост.Дата = ТекущаяДата();
			ДокСост.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Иначе
			Если ДокСост.ПометкаУдаления = Истина Тогда 
				ДокСост.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
		ДокСост.ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации;
		ДокСост.Организация = Организация;
		ДокСост.Подразделение = Подразделение;
		ДокСост.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.гкс_АварийныйПростой;
		ДокСост.гкс_ПричинаСоздания = 1;
		ДокСост.ДокументОснование = Ссылка;
		ДокСост.ОбъектыРемонта.Очистить();
		Выборка = РезультатЗапроса[ПакетОдин].Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ДокСост.ОбъектыРемонта.Добавить();
			НоваяСтрока.ДатаОкончания = ДатаОбнаружения;
			НоваяСтрока.ОбъектРемонта = Выборка.ОР;
			НоваяСтрока.Иерархия = ТекИерархия;
			НоваяСтрока.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.гкс_АварийныйПростой;
			НоваяСтрока.ПричинаПростоя = Справочники.торо_ПричиныПростояОборудования.гкс_ВыявленДефектОборудования;
			НоваяСтрока.ИзменятьСостояниеПодчиненныхОР = Истина;
		КонецЦикла;
		ДокСост.БезусловнаяЗапись = Истина; // если нужно провести без проверок
		ДокСост.Записать(РежимЗаписиДокумента.Проведение);
		МассивДокДляПерепроведения.Добавить(ДокСост.Ссылка);
	Иначе
		Если Не ДокСост = Неопределено И ДокСост.ПометкаУдаления = Ложь Тогда 
			ДокСост.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЕсли;
	НайтиИПерепровестиДокументыСостояния(МассивДокДляПерепроведения);
КонецПроцедуры
// гкс- [Релиз 1] Куст 16.12.2020

// гкс+ [Релиз 1] Куст 16.12.2020
Процедура ПроверитьАварийныйПростой()
	ТекОб = Справочники.торо_ВидыЭксплуатации.гкс_АварийныйПростой.ПолучитьОбъект();
	Если Не ТекОб.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Простой Тогда 
		ТекОб.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Простой;
		ТекОб.Записать();
	КонецЕсли;
	ТекОб = Справочники.торо_ПричиныПростояОборудования.гкс_ВыявленДефектОборудования.ПолучитьОбъект();
	Если Не ТекОб.ВидПростоя = Перечисления.торо_ВидыПростояОборудования.АварийныеРемонтныеРаботы Тогда 
		ТекОб.ВидПростоя = Перечисления.торо_ВидыПростояОборудования.АварийныеРемонтныеРаботы;
		ТекОб.Записать();
	КонецЕсли;
	ТекОб = Справочники.торо_ВидыЭксплуатации.гкс_Эксплуатация.ПолучитьОбъект();
	Если Не ТекОб.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Эксплуатация Тогда 
		ТекОб.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Эксплуатация;
		ТекОб.Записать();
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 16.12.2020

// гкс+ [Релиз 1] Куст 21.12.2020
Процедура НайтиИПерепровестиДокументыСостояния(МассивДок)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ТекущееСостояниеОР.Период КАК Период,
	               |	торо_ТекущееСостояниеОР.ОбъектРемонта КАК ОР
	               |ПОМЕСТИТЬ Стартовые
	               |ИЗ
	               |	РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |ГДЕ
	               |	торо_ТекущееСостояниеОР.Регистратор В (&МассивДок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Стартовые.ОР КАК ОР,
	               |	Стартовые.Период КАК Период,
	               |	МИНИМУМ(торо_ТекущееСостояниеОР.Период) КАК СледующийПериод
	               |ПОМЕСТИТЬ СрезПервыхСостояний
	               |ИЗ
	               |	Стартовые КАК Стартовые
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |		ПО Стартовые.ОР = торо_ТекущееСостояниеОР.ОбъектРемонта
	               |			И Стартовые.Период < торо_ТекущееСостояниеОР.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Стартовые.ОР,
	               |	Стартовые.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ТекущееСостояниеОР.Регистратор КАК Ссылка,
	               |	МИНИМУМ(торо_ТекущееСостояниеОР.Период) КАК Период
	               |ИЗ
	               |	СрезПервыхСостояний КАК СрезПервыхСостояний
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |		ПО СрезПервыхСостояний.ОР = торо_ТекущееСостояниеОР.ОбъектРемонта
	               |			И СрезПервыхСостояний.СледующийПериод = торо_ТекущееСостояниеОР.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	торо_ТекущееСостояниеОР.Регистратор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Запрос.УстановитьПараметр("МассивДок", МассивДок);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			ДокСост = Выборка.Ссылка.ПолучитьОбъект();
			ДокСост.БезусловнаяЗапись = Истина; // если нужно провести без проверок
			ДокСост.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 21.12.2020


&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Для Каждого Дефект Из СписокДефектов Цикл
		Если Не ЗначениеЗаполнено(Дефект.ID) Тогда
			Дефект.ID = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;

	#Вставка	
	// Гкс+[TOIR20-469/TOIR20-591] Зозуля А.В. от 23.06.2025. Добавлено:{
	Если ОбменДанными.Загрузка = Ложь И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если гкс_ИнтеграцияС1СДокументооборот.НетПрикрепленныхФайловДО(Ссылка) 
			И гкс_ФайлыФиксации.Количество() = 0 Тогда  
			ТекстСообщения = НСтр("ru='Для проведения документа необходимо добавить файл на вкладку «Документооборот» либо проверить наличие «Файлов фиксации»';
								  |en='To process a document, you need to add a file to the “Document Flow” tab or check for the presence of “Fixed Files”'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;			
		КонецЕсли;	
	КонецЕсли;	
	// } Гкс-[TOIR20-469/TOIR20-591] Зозуля А.В. от 23.06.2025.
		
	Если ОбменДанными.Загрузка = Ложь И РежимЗаписи = РежимЗаписиДокумента.Проведение И Не гкс_ЕвоПроведен() Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Отсутствует проведенный EWO-Бланк.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МассивОД = Новый Массив();
	Для Каждого ТекСтрокаСписокДефектов Из СписокДефектов Цикл
		
		Если ТекСтрокаСписокДефектов.КритичностьДефекта.Пустая() Тогда
			ШаблонСообщения = НСтр("es='No se especifica la criticidad del defecto.';ru='Не указана критичность дефекта %1/%2.';en='The defect criticality %1 /%2 is not specified.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрокаСписокДефектов.ОбъектРемонта, ТекСтрокаСписокДефектов.ОтказавшийЭлемент);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТекСтрокаСписокДефектов.ДефектОписание) Тогда 
			МассивОД.Добавить(ТекСтрокаСписокДефектов.ДефектОписание);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	гкс_ОписаниеДефектаСписком = СтрСоединить(МассивОД, ", ");

	МассивОР = СписокДефектов.ВыгрузитьКолонку("ОтказавшийЭлемент");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка КАК ОР
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&Ссылка)
		|	И торо_ОбъектыРемонта.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)";
	Запрос.УстановитьПараметр("Ссылка", МассивОР);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Отказ = истина;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = """+Выборка.ОР+" является функциональным местом! Введите дефект для установленного объекта ремонта!"";");
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	гкс_СимптомДефекта = Неопределено;
	Для Каждого СТ Из СписокДефектов Цикл
		гкс_СимптомДефекта = СТ.гкс_СимптомДефекта;
		Прервать;
	КонецЦикла;
	гкс_КатегорияРиска = Неопределено;
	Для Каждого СТ Из РезультатыПодбораИзМатрицыОценкиРисков Цикл
		Если СТ.РезультатВыбора = Истина Тогда 
			гкс_КатегорияРиска = СТ.КатегорияРиска;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Гкс+[TOIR20-673] Зозуля А.В. от 05.08.2025. Добавлено:{
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("гкс_СтатусДокументаНовый", Истина);	
	КонецЕсли;	
	// } Гкс-[TOIR20-673] Зозуля А.В. от 05.08.2025.
	#КонецВставки
КонецПроцедуры

Функция гкс_ЕвоПроведен()
	Если Дата < Дата(2023,11,1) Тогда
		Возврат Истина;
	ИначеЕсли гкс_Влияние = Перечисления.гкс_Влияние.БезВлияния Тогда 
		Возврат Истина;
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ЕВОБланк.Проведен КАК Проведен,
		|	гкс_ЕВОБланк.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.гкс_ЕВОБланк КАК гкс_ЕВОБланк
		|ГДЕ
		|	гкс_ЕВОБланк.ДокументОснование = &СсылкаВД
		|	И гкс_ЕВОБланк.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("СсылкаВД", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Ложь;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Проведен;
	КонецЕсли;
КонецФункции

&ИзменениеИКонтроль("ОбработкаУдаленияПроведения")
Процедура гкс_ОбработкаУдаленияПроведения(Отказ)

	Если Не Отказ Тогда
		торо_РаботаСоСтатусамиДокументовСервер.ОтменаПроведения(Ссылка);
	КонецЕсли;	
    #Вставка
	// Гкс+[TOIR20-673] Зозуля А.В. от 07.08.2025. Добавлено:{
	ДополнительныеСвойства.Вставить("гкс_СтатусДокументаНовый", Истина);
	// Гкс-[TOIR20-673] Зозуля А.В. от 07.08.2025. 
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти
